mediaMicroservices/wrk2/outs/c300_r500.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 300 connections
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 9999.974ms, rate sampling interval: 20021ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.30s    14.11s    0.88m    60.70%
    Req/Sec     7.00      0.00     7.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.08s 
 75.000%   40.99s 
 90.000%   50.04s 
 99.000%    0.88m 
 99.900%    0.92m 
 99.990%    0.93m 
 99.999%    0.93m 
100.000%    0.93m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          232         1.00
   10002.431     0.100000          232         1.11
   18841.599     0.200000          297         1.25
   20070.399     0.300000          446         1.43
   27901.951     0.400000          593         1.67
   30081.023     0.500000          741         2.00
   30801.919     0.550000          815         2.22
   37421.055     0.600000          889         2.50
   39157.759     0.650000          963         2.86
   40108.031     0.700000         1038         3.33
   40992.767     0.750000         1112         4.00
   41811.967     0.775000         1148         4.44
   46497.791     0.800000         1185         5.00
   48365.567     0.825000         1223         5.71
   48955.391     0.850000         1260         6.67
   49414.143     0.875000         1296         8.00
   49774.591     0.887500         1316         8.89
   50036.735     0.900000         1334        10.00
   50266.111     0.912500         1356        11.43
   50528.255     0.925000         1371        13.33
   50823.167     0.937500         1390        16.00
   50888.703     0.943750         1398        17.78
   51052.543     0.950000         1407        20.00
   51347.455     0.956250         1418        22.86
   51445.759     0.962500         1426        26.67
   51740.671     0.968750         1435        32.00
   52035.583     0.971875         1440        35.56
   52166.655     0.975000         1444        40.00
   52264.959     0.978125         1450        45.71
   52297.727     0.981250         1456        53.33
   52363.263     0.984375         1459        64.00
   52494.335     0.985938         1461        71.11
   52592.639     0.987500         1463        80.00
   52658.175     0.989062         1465        91.43
   52985.855     0.990625         1468       106.67
   53182.463     0.992188         1470       128.00
   53379.071     0.992969         1471       142.22
   53444.607     0.993750         1472       160.00
   53673.983     0.994531         1473       182.86
   53739.519     0.995313         1475       213.33
   54165.503     0.996094         1476       256.00
   54165.503     0.996484         1476       284.44
   54558.719     0.996875         1477       320.00
   54558.719     0.997266         1477       365.71
   54591.487     0.997656         1478       426.67
   54657.023     0.998047         1479       512.00
   54657.023     0.998242         1479       568.89
   54657.023     0.998437         1479       640.00
   54657.023     0.998633         1479       731.43
   54951.935     0.998828         1480       853.33
   54951.935     0.999023         1480      1024.00
   54951.935     0.999121         1480      1137.78
   54951.935     0.999219         1480      1280.00
   54951.935     0.999316         1480      1462.86
   55607.295     0.999414         1481      1706.67
   55607.295     1.000000         1481          inf
#[Mean    =    30304.028, StdDeviation   =    14113.921]
#[Max     =    55574.528, Total count    =         1481]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1500 requests in 1.00m, 522.95KB read
  Socket errors: connect 0, read 0, write 0, timeout 330
  Non-2xx or 3xx responses: 1500
Requests/sec:     24.92
Transfer/sec:      8.69KB