mediaMicroservices/wrk2/outs/c500_r1000.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 500 connections
  Thread calibration: mean lat.: 648.407ms, rate sampling interval: 2001ms
  Thread calibration: mean lat.: 659.623ms, rate sampling interval: 2077ms
  Thread calibration: mean lat.: 510.188ms, rate sampling interval: 1694ms
  Thread calibration: mean lat.: 651.139ms, rate sampling interval: 2039ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.46s    14.15s    0.88m    60.00%
    Req/Sec    12.43     16.44    54.00     82.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.43s 
 75.000%   41.25s 
 90.000%   50.36s 
 99.000%    0.88m 
 99.900%    0.91m 
 99.990%    0.92m 
 99.999%    0.92m 
100.000%    0.92m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          143         1.00
   10231.807     0.100000          251         1.11
   13328.383     0.200000          500         1.25
   20414.463     0.300000          753         1.43
   24150.015     0.400000         1000         1.67
   30425.087     0.500000         1256         2.00
   31129.599     0.550000         1377         2.22
   34045.951     0.600000         1500         2.50
   39616.511     0.650000         1625         2.86
   40435.711     0.700000         1752         3.33
   41254.911     0.750000         1877         4.00
   41975.807     0.775000         1939         4.44
   44367.871     0.800000         2000         5.00
   48791.551     0.825000         2064         5.71
   49512.447     0.850000         2125         6.67
   49938.431     0.875000         2193         8.00
   50102.271     0.887500         2219         8.89
   50364.415     0.900000         2252        10.00
   50593.791     0.912500         2287        11.43
   50823.167     0.925000         2313        13.33
   51085.311     0.937500         2344        16.00
   51216.383     0.943750         2361        17.78
   51281.919     0.950000         2375        20.00
   51511.295     0.956250         2391        22.86
   51675.135     0.962500         2409        26.67
   51806.207     0.968750         2422        32.00
   51970.047     0.971875         2430        35.56
   52068.351     0.975000         2438        40.00
   52232.191     0.978125         2447        45.71
   52461.567     0.981250         2455        53.33
   52625.407     0.984375         2461        64.00
   52723.711     0.985938         2466        71.11
   52789.247     0.987500         2471        80.00
   52822.015     0.989062         2473        91.43
   52953.087     0.990625         2477       106.67
   53051.391     0.992188         2481       128.00
   53116.927     0.992969         2484       142.22
   53247.999     0.993750         2486       160.00
   53280.767     0.994531         2489       182.86
   53280.767     0.995313         2489       213.33
   53608.447     0.996094         2491       256.00
   53673.983     0.996484         2492       284.44
   53706.751     0.996875         2493       320.00
   54067.199     0.997266         2494       365.71
   54099.967     0.997656         2495       426.67
   54296.575     0.998047         2496       512.00
   54296.575     0.998242         2496       568.89
   54329.343     0.998437         2497       640.00
   54329.343     0.998633         2497       731.43
   54624.255     0.998828         2498       853.33
   54624.255     0.999023         2498      1024.00
   54624.255     0.999121         2498      1137.78
   54853.631     0.999219         2499      1280.00
   54853.631     0.999316         2499      1462.86
   54853.631     0.999414         2499      1706.67
   54853.631     0.999512         2499      2048.00
   54853.631     0.999561         2499      2275.56
   55476.223     0.999609         2500      2560.00
   55476.223     1.000000         2500          inf
#[Mean    =    30457.810, StdDeviation   =    14150.510]
#[Max     =    55443.456, Total count    =         2500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3199 requests in 1.00m, 1.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 274
  Non-2xx or 3xx responses: 2817
Requests/sec:     53.11
Transfer/sec:     17.45KB