mediaMicroservices/wrk2/outs/c500_r250.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 500 connections
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 10001.066ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 10003.251ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 10001.066ms, rate sampling interval: 20021ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    27.69s    13.12s    0.88m    57.09%
    Req/Sec    10.88      0.60    12.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.90s 
 75.000%   38.96s 
 90.000%   45.78s 
 99.000%    0.88m 
 99.900%    0.92m 
 99.990%    0.94m 
 99.999%    0.94m 
100.000%    0.94m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          395         1.00
   10002.431     0.100000          395         1.11
   10010.623     0.200000          490         1.25
   19562.495     0.300000          673         1.43
   21872.639     0.400000          897         1.67
   27901.951     0.500000         1121         2.00
   30130.175     0.550000         1234         2.22
   31621.119     0.600000         1346         2.50
   33538.047     0.650000         1458         2.86
   36438.015     0.700000         1572         3.33
   38961.151     0.750000         1685         4.00
   40108.031     0.775000         1738         4.44
   41058.303     0.800000         1795         5.00
   41910.271     0.825000         1850         5.71
   42926.079     0.850000         1906         6.67
   44597.247     0.875000         1963         8.00
   45318.143     0.887500         1991         8.89
   45776.895     0.900000         2018        10.00
   46596.095     0.912500         2046        11.43
   47284.223     0.925000         2074        13.33
   48103.423     0.937500         2102        16.00
   48562.175     0.943750         2117        17.78
   49119.231     0.950000         2131        20.00
   49610.751     0.956250         2144        22.86
   50036.735     0.962500         2160        26.67
   50462.719     0.968750         2172        32.00
   50626.559     0.971875         2179        35.56
   50921.471     0.975000         2186        40.00
   51150.847     0.978125         2193        45.71
   51576.831     0.981250         2202        53.33
   51838.975     0.984375         2207        64.00
   52068.351     0.985938         2211        71.11
   52363.263     0.987500         2214        80.00
   52625.407     0.989062         2219        91.43
   52854.783     0.990625         2222       106.67
   52953.087     0.992188         2225       128.00
   53051.391     0.992969         2227       142.22
   53477.375     0.993750         2228       160.00
   53608.447     0.994531         2231       182.86
   53641.215     0.995313         2232       213.33
   53936.127     0.996094         2234       256.00
   53968.895     0.996484         2236       284.44
   53968.895     0.996875         2236       320.00
   53968.895     0.997266         2236       365.71
   54034.431     0.997656         2237       426.67
   54132.735     0.998047         2238       512.00
   54984.703     0.998242         2239       568.89
   54984.703     0.998437         2239       640.00
   54984.703     0.998633         2239       731.43
   55279.615     0.998828         2240       853.33
   55279.615     0.999023         2240      1024.00
   55574.527     0.999121         2241      1137.78
   55574.527     0.999219         2241      1280.00
   55574.527     0.999316         2241      1462.86
   55574.527     0.999414         2241      1706.67
   55574.527     0.999512         2241      2048.00
   56459.263     0.999561         2242      2275.56
   56459.263     1.000000         2242          inf
#[Mean    =    27693.480, StdDeviation   =    13116.206]
#[Max     =    56426.496, Total count    =         2242]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2261 requests in 1.00m, 788.26KB read
  Socket errors: connect 0, read 0, write 0, timeout 5372
  Non-2xx or 3xx responses: 2261
Requests/sec:     37.65
Transfer/sec:     13.13KB